---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeType.AddReferencePlane(Autodesk.Revit.DB.Plane)
source: html/bdc6e714-a2ab-8a33-95be-657ebb217157.htm
---
# Autodesk.Revit.DB.DirectShapeType.AddReferencePlane Method

Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.

## Syntax (C#)
```csharp
public void AddReferencePlane(
	Plane refPlane
)
```

## Parameters
- **refPlane** (`Autodesk.Revit.DB.Plane`) - The geometry of the new reference plane.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null